# Linear regression with multiple variables

#### Decidindg salary for candidates based on experience, test score and interview score (using sample data)

In [108]:
import pandas as pd
import numpy as np
from sklearn import linear_model
import math

In [109]:
#load data from csv
df = pd.read_csv('hiring.csv')
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0         NaN                    8.0                           9      50000
1         NaN                    8.0                           6      45000
2         5.0                    6.0                           7      60000
3         2.0                   10.0                          10      65000
4         7.0                    9.0                           6      70000
5         3.0                    7.0                          10      62000
6        10.0                    NaN                           7      72000
7        11.0                    7.0                           8      80000

In [110]:
#mean for test score
mean_test_score = math.ceil(df['test_score(out of 10)'].mean())
mean_test_score

8

In [111]:
# fill empty values
df['test_score(out of 10)'] =  df['test_score(out of 10)'].fillna(mean_test_score)
df['experience'] = df['experience'].fillna(0)
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0         0.0                    8.0                           9      50000
1         0.0                    8.0                           6      45000
2         5.0                    6.0                           7      60000
3         2.0                   10.0                          10      65000
4         7.0                    9.0                           6      70000
5         3.0                    7.0                          10      62000
6        10.0                    8.0                           7      72000
7        11.0                    7.0                           8      80000

In [112]:
# model
reg = linear_model.LinearRegression()
reg.fit( df.drop('salary($)', axis = 'columns') , df['salary($)'] )

LinearRegression()

In [113]:
reg.coef_

array([2812.95487627, 1845.70596798, 2205.24017467])

In [114]:
reg.intercept_

17737.263464337688

#### Decide salary for a candidate having 2 yr experiene, 6 test score and 9 interview score

In [115]:
reg.predict([[2, 6, 9]])

array([54284.5705968])

***54284.5705968$***